# RRectangleN

## Description
Creates and returns a handle to a new rotated rectangle object with the specified bounds

```pascal
PROCEDURE RRectangleN(
				orginX,orginY         : REAL;
				directionX,directionY : REAL;
				width                 : REAL;
				height                : REAL;
				xDiam                 : REAL;
				yDiam                 : REAL);
```

```python
def vs.RRectangleN(orgin, direction, width, height, xDiam, yDiam):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|orgin|REAL|   |
|direction|REAL|   |
|width|REAL|   |
|height|REAL|   |
|xDiam|REAL|   |
|yDiam|REAL|   |

## Version
Availability: from VectorWorks13.0

## Category
* Objects - 2D